levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmr4.c
/**
 *******************************************************************************
 * @file  hc32m423_tmr4.c
 * @brief This file provides firmware functions to manage the TMR4(Timer4)
 @verbatim
   Change Logs:
   Date             Author          Notes
   2020-01-01       Hongjh          First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32m423_tmr4.h"
#include "hc32m423_utility.h"

/**
 * @addtogroup HC32M423_DDL_Driver
 * @{
 */

/**
 * @defgroup DDL_TMR4 TMR4
 * @brief TMR4 Driver Library
 * @{
 */

#if (DDL_TMR4_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup TMR4_Local_Macros TMR4 Local Macros
 * @{
 */

/**
 * @defgroup TMR4_Check_Parameters_Validity TMR4 Check Parameters Validity
 * @{
 */

#define IS_VALID_TMR4_INSTANCE(x)               (M4_TMR4 == (x))

#define IS_VALID_TMR4_CNT_PCLK_DIV(x)                                           \
(   (TMR4_CNT_PCLK_DIV1 == (x))                  ||                             \
    (TMR4_CNT_PCLK_DIV2 == (x))                  ||                             \
    (TMR4_CNT_PCLK_DIV4 == (x))                  ||                             \
    (TMR4_CNT_PCLK_DIV8 == (x))                  ||                             \
    (TMR4_CNT_PCLK_DIV16 == (x))                 ||                             \
    (TMR4_CNT_PCLK_DIV32 == (x))                 ||                             \
    (TMR4_CNT_PCLK_DIV64 == (x))                 ||                             \
    (TMR4_CNT_PCLK_DIV128 == (x))                ||                             \
    (TMR4_CNT_PCLK_DIV256 == (x))                ||                             \
    (TMR4_CNT_PCLK_DIV512 == (x))                ||                             \
    (TMR4_CNT_PCLK_DIV1024 == (x)))

#define IS_VALID_TMR4_CNT_MODE(x)                                              \
(   (TMR4_CNT_MODE_SAWTOOTH_WAVE == (x))        ||                             \
    (TMR4_CNT_MODE_TRIANGLE_WAVE == (x)))

#define IS_VALID_TMR4_CNT_BUF_STATE(x)                                         \
(   (TMR4_CNT_BUFFER_ENABLE == (x))             ||                             \
    (TMR4_CNT_BUFFER_DISABLE == (x)))

#define IS_VALID_TMR4_CNT_CLK_SRC(x)                                           \
(   (TMR4_CNT_PCLK == (x))                      ||                             \
    (TMR4_CNT_EXTCLK == (x)))

#define IS_VALID_TMR4_CNT_INT_MASKTIMES(x)                                     \
(   (TMR4_CNT_INT_MASK_0 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_1 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_2 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_3 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_4 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_5 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_6 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_7 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_8 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_9 == (x))                ||                             \
    (TMR4_CNT_INT_MASK_10 == (x))               ||                             \
    (TMR4_CNT_INT_MASK_11 == (x))               ||                             \
    (TMR4_CNT_INT_MASK_12 == (x))               ||                             \
    (TMR4_CNT_INT_MASK_13 == (x))               ||                             \
    (TMR4_CNT_INT_MASK_14 == (x))               ||                             \
    (TMR4_CNT_INT_MASK_15 == (x)))

#define IS_VALID_TMR4_CNT_INT(x)                                               \
(   (0UL != (x))                                 &&                            \
    (TMR4_CNT_INT_MASK == ((x) | TMR4_CNT_INT_MASK)))

#define IS_VALID_TMR4_CNT_FLAG(x)                                              \
(   (0UL != (x))                                 &&                            \
    (TMR4_CNT_FLAG_MASK == ((x) | TMR4_CNT_FLAG_MASK)))

