levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmr4.c
#define IS_VALID_TMR4_OCO_CH(x)                                                \
(   (TMR4_OCO_UH == (x))                        ||                             \
    (TMR4_OCO_UL == (x))                        ||                             \
    (TMR4_OCO_VH == (x))                        ||                             \
    (TMR4_OCO_VL == (x))                        ||                             \
    (TMR4_OCO_WH == (x))                        ||                             \
    (TMR4_OCO_WL == (x)))

#define IS_VALID_TMR4_OCO_HIGH_CH(x)                                           \
(   (TMR4_OCO_UH == (x))                        ||                             \
    (TMR4_OCO_VH == (x))                        ||                             \
    (TMR4_OCO_WH == (x)))

#define IS_VALID_TMR4_OCO_LOW_CH(x)                                            \
(   (TMR4_OCO_UL == (x))                        ||                             \
    (TMR4_OCO_VL == (x))                        ||                             \
    (TMR4_OCO_WL == (x)))

#define IS_VALID_TMR4_OCO_STATE(x)                                             \
(   (TMR4_OCO_DISABLE == (x))                   ||                             \
    (TMR4_OCO_ENABLE == (x)))

#define IS_VALID_TMR4_OCO_EXTEND_MATCH(x)                                      \
(   (TMR4_OCO_EXTEND_MATCH_DISABLE == (x))      ||                             \
    (TMR4_OCO_EXTEND_MATCH_ENABLE == (x)))

#define IS_VALID_TMR4_OCO_OCCR_LINK_TRANSFER(x)                                \
(   (TMR4_OCO_OCCR_LINK_TRANSFER_DISABLE == (x))    ||                         \
    (TMR4_OCO_OCCR_LINK_TRANSFER_ENABLE == (x)))

#define IS_VALID_TMR4_OCO_OCCR_BUF_MODE(x)                                     \
(   (TMR4_OCO_OCCR_BUF_DISABLE == (x))          ||                             \
    (TMR4_OCO_OCCR_BUF_CNT_ZERO == (x))         ||                             \
    (TMR4_OCO_OCCR_BUF_CNT_PEAK == (x))         ||                             \
    (TMR4_OCO_OCCR_BUF_CNT_ZERO_OR_PEAK == (x)))

#define IS_VALID_TMR4_OCO_OCMR_LINK_TRANSFER(x)                                \
(   (TMR4_OCO_OCMR_LINK_TRANSFER_DISABLE == (x))    ||                         \
    (TMR4_OCO_OCMR_LINK_TRANSFER_ENABLE == (x)))

#define IS_VALID_TMR4_OCO_OCMR_BUF_MODE(x)                                     \
(   (TMR4_OCO_OCMR_BUF_DISABLE == (x))          ||                             \
    (TMR4_OCO_OCMR_BUF_CNT_ZERO == (x))         ||                             \
    (TMR4_OCO_OCMR_BUF_CNT_PEAK == (x))         ||                             \
    (TMR4_OCO_OCMR_BUF_CNT_ZERO_OR_PEAK == (x)))

#define IS_VALID_TMR4_OCO_PORT_INVALID_OP(x)                                   \
(   (TMR4_OCO_INVAILD_OP_LOW == (x))            ||                             \
    (TMR4_OCO_INVAILD_OP_HIGH == (x)))

#define IS_VALID_TMR4_OCO_OCF_STATE(x)                                         \
(   (TMR4_OCO_OCF_HOLD == (x))                  ||                             \
    (TMR4_OCO_OCF_SET == (x)))

#define IS_VALID_TMR4_OCO_OUTPUT_POLARITY(x)                                   \
(   (TMR4_OCO_OP_HOLD == (x))                   ||                             \
    (TMR4_OCO_OP_HIGH == (x))                   ||                             \
    (TMR4_OCO_OP_LOW == (x))                    ||                             \
    (TMR4_OCO_OP_INVERT == (x)))

#define IS_VALID_TMR4_PWM_CH(x)                                                \
(   (TMR4_PWM_U == (x))                         ||                             \
    (TMR4_PWM_V == (x))                         ||                             \
    (TMR4_PWM_W == (x)))

#define IS_VALID_TMR4_PWM_PORT(x)                                              \
(   (TMR4_PWM_PORT_OUH == (x))                  ||                             \
    (TMR4_PWM_PORT_OUL == (x))                  ||                             \
    (TMR4_PWM_PORT_OVH == (x))                  ||                             \
    (TMR4_PWM_PORT_OVL == (x))                  ||                             \
    (TMR4_PWM_PORT_OWH == (x))                  ||                             \
    (TMR4_PWM_PORT_OWL == (x)))

#define IS_VALID_TMR4_PWM_MODE(x)                                              \
(   (TMR4_PWM_THROUGH_MODE == (x))              ||                             \
    (TMR4_PWM_DEAD_TIMER_MODE == (x))           ||                             \
    (TMR4_PWM_DEAD_TIMER_FILTER_MODE == (x)))

#define IS_VALID_TMR4_PWM_TRANSFORM_OCO_POLARITY(x)                            \
(   (TMR4_PWM_OP_OXH_HOLD_OXL_HOLD == (x))      ||                             \
    (TMR4_PWM_OP_OXH_INVERT_OXL_HOLD == (x))    ||                             \
    (TMR4_PWM_OP_OXH_HOLD_OXL_INVERT == (x))    ||                             \
    (TMR4_PWM_OP_OXH_INVERT_OXL_INVERT == (x)))

#define IS_VALID_TMR4_PWM_PCLK_DIV(x)                                          \
(   (TMR4_PWM_PCLK_DIV1 == (x))                 ||                             \
    (TMR4_PWM_PCLK_DIV2 == (x))                 ||                             \
    (TMR4_PWM_PCLK_DIV4 == (x))                 ||                             \
    (TMR4_PWM_PCLK_DIV8 == (x))                 ||                             \
    (TMR4_PWM_PCLK_DIV16 == (x))                ||                             \
    (TMR4_PWM_PCLK_DIV32 == (x))                ||                             \
    (TMR4_PWM_PCLK_DIV64 == (x))                ||                             \
    (TMR4_PWM_PCLK_DIV128 == (x)))

#define IS_VALID_TMR4_PWM_EMB_PORT_OUTPUT_STATE(x)                             \
(   (TMR4_PWM_EMB_PORT_OUTPUT_NORMAL == (x))    ||                             \
    (TMR4_PWM_EMB_PORT_OUTPUT_HIZ == (x))       ||                             \
    (TMR4_PWM_EMB_PORT_OUTPUT_LOW == (x))       ||                             \
    (TMR4_PWM_EMB_PORT_OUTPUT_HIGH == (x)))

#define IS_VALID_TMR4_PWM_PORT_ENBIT_EFFECT(x)                                 \
(   (TMR4_PWM_PORT_ENBIT_EFFECT_IMMEDIATE == (x))   ||                         \
    (TMR4_PWM_PORT_ENBIT_EFFECT_CNTUVF == (x))      ||                         \
    (TMR4_PWM_PORT_ENBIT_EFFECT_CNTOVF == (x)))

#define IS_VALID_TMR4_PWM_PORT_MODE(x)                                         \
(   (TMR4_PWM_PORT_OUTPUT_OSxy == (x))          ||                             \
    (TMR4_PWM_PORT_OUTPUT_NORMAL == (x)))

#define IS_VALID_TMR4_SEVT_CH(x)                                               \
(   (TMR4_SEVT_UH == (x))                       ||                             \
    (TMR4_SEVT_UL == (x))                       ||                             \
    (TMR4_SEVT_VH == (x))                       ||                             \
    (TMR4_SEVT_VL == (x))                       ||                             \
    (TMR4_SEVT_WH == (x))                       ||                             \
    (TMR4_SEVT_WL == (x)))

#define IS_VALID_TMR4_SEVT_LINK_TRANSFER(x)                                    \
(   (TMR4_SEVT_LINK_TRANSFER_DISABLE == (x))    ||                             \
    (TMR4_SEVT_LINK_TRANSFER_ENABLE == (x)))

#define IS_VALID_TMR4_SEVT_DOWN_SEL(x)                                         \
(   (TMR4_SEVT_DOWN_DISABLE == (x))             ||                             \
    (TMR4_SEVT_DOWN_ENABLE == (x)))

#define IS_VALID_TMR4_SEVT_UP_SEL(x)                                           \
(   (TMR4_SEVT_UP_DISABLE == (x))               ||                             \
    (TMR4_SEVT_UP_ENABLE == (x)))

