levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmr4.c
#define IS_VALID_TMR4_SEVT_PEAK_SEL(x)                                         \
(   (TMR4_SEVT_PEAK_DISABLE == (x))             ||                             \
    (TMR4_SEVT_PEAK_ENABLE == (x)))

#define IS_VALID_TMR4_SEVT_ZERO_SEL(x)                                         \
(   (TMR4_SEVT_ZERO_DISABLE == (x))             ||                             \
    (TMR4_SEVT_ZERO_ENABLE == (x)))

#define IS_VALID_TMR4_SEVT_ZERO_MATCH_MASK_SEL(x)                              \
(   (TMR4_SEVT_ZERO_MATCH_MASK_DISABLE == (x))  ||                             \
    (TMR4_SEVT_ZERO_MATCH_MASK_ENABLE == (x)))

#define IS_VALID_TMR4_SEVT_PEAK_MATCH_MASK_SEL(x)                              \
(   (TMR4_SEVT_PEAK_MATCH_MASK_DISABLE == (x))  ||                             \
    (TMR4_SEVT_PEAK_MATCH_MASK_ENABLE == (x)))

#define IS_VALID_TMR4_SEVT_OBJECT(x)                                           \
(   (TMR4_SEVT_DELAY_OCCRXH == (x))             ||                             \
    (TMR4_SEVT_DELAY_OCCRXL == (x)))

#define IS_VALID_TMR4_SEVT_MODE(x)                                             \
(   (TMR4_SEVT_MODE_DELAY_TRIGGER == (x))       ||                             \
    (TMR4_SEVT_MODE_COMPARE_TRIGGER == (x)))

#define IS_VALID_TMR4_SEVT_MASK(x)                                             \
(   (TMR4_SEVT_MASK_0 == (x))                   ||                             \
    (TMR4_SEVT_MASK_1 == (x))                   ||                             \
    (TMR4_SEVT_MASK_2 == (x))                   ||                             \
    (TMR4_SEVT_MASK_3 == (x))                   ||                             \
    (TMR4_SEVT_MASK_4 == (x))                   ||                             \
    (TMR4_SEVT_MASK_5 == (x))                   ||                             \
    (TMR4_SEVT_MASK_6 == (x))                   ||                             \
    (TMR4_SEVT_MASK_7 == (x))                   ||                             \
    (TMR4_SEVT_MASK_8 == (x))                   ||                             \
    (TMR4_SEVT_MASK_9 == (x))                   ||                             \
    (TMR4_SEVT_MASK_10 == (x))                  ||                             \
    (TMR4_SEVT_MASK_11 == (x))                  ||                             \
    (TMR4_SEVT_MASK_12 == (x))                  ||                             \
    (TMR4_SEVT_MASK_13 == (x))                  ||                             \
    (TMR4_SEVT_MASK_14 == (x))                  ||                             \
    (TMR4_SEVT_MASK_15 == (x)))

#define IS_VALID_TMR4_SEVT_OUTPUT_EVENT(x)                                     \
(   (TMR4_SEVT_OUTPUT_EVENT0 == (x))            ||                             \
    (TMR4_SEVT_OUTPUT_EVENT1 == (x))            ||                             \
    (TMR4_SEVT_OUTPUT_EVENT2 == (x))            ||                             \
    (TMR4_SEVT_OUTPUT_EVENT3 == (x))            ||                             \
    (TMR4_SEVT_OUTPUT_EVENT4 == (x))            ||                             \
    (TMR4_SEVT_OUTPUT_EVENT5 == (x)))

#define IS_VALID_TMR4_SEVT_BUF_MODE(x)                                         \
(   (TMR4_SEVT_BUF_DISABLE == (x))              ||                             \
    (TMR4_SEVT_BUF_CNT_ZERO == (x))             ||                             \
    (TMR4_SEVT_BUF_CNT_PEAK == (x))             ||                             \
    (TMR4_SEVT_BUF_CNT_ZERO_OR_PEAK == (x)))

#define IS_VALID_TMR4_SEVT_PORT_OUTPUT_SIGNAL(x)                               \
(   (TMR4_SEVT_PORT_OUTPUT_NONE == (x))             ||                         \
    (TMR4_SEVT_PORT_OUTPUT_EVENT0_SIGNAL == (x))    ||                         \
    (TMR4_SEVT_PORT_OUTPUT_EVENT1_SIGNAL == (x))    ||                         \
    (TMR4_SEVT_PORT_OUTPUT_EVENT2_SIGNAL == (x))    ||                         \
    (TMR4_SEVT_PORT_OUTPUT_EVENT3_SIGNAL == (x))    ||                         \
    (TMR4_SEVT_PORT_OUTPUT_EVENT4_SIGNAL == (x))    ||                         \
    (TMR4_SEVT_PORT_OUTPUT_EVENT5_SIGNAL == (x)))
/**
 * @}
 */

/**
 * @defgroup TMR4_Register_Address Get TMR4 register address
 * @{
 */
#define REG_ADDR(__REG__)                   ((uint32_t)(&(__REG__)))
/**
 * @}
 */

/**
 * @defgroup TMR4_Register_Shift_Bits Get register value shift bit
 * @{
 */
#define SHIFT_1BIT(__CH__)                  ((uint16_t)((__CH__) % 2UL))
#define SHIFT_2BIT(__CH__)                  ((uint16_t)(((__CH__) % 2UL) << 1UL))
/**
 * @}
 */

/**
 * @defgroup TMR4_OCO_Register TMR4 OCO Register
 * @brief Get the specified OCO register address of the specified TMR4 unit
 * @note __CH__ value is TMR4_OCO_xy (x=U/V/W, y=H/L)
 * @{
 */
#define TMR4_OCCRx(__TMR4x__, __CH__)       ((__IO uint16_t *)(REG_ADDR((__TMR4x__)->OCCRUH) + (((uint32_t)(__CH__)) << 2UL)))
#define TMR4_OCMRx(__TMR4x__, __CH__)       ((__IO uint16_t *)(REG_ADDR((__TMR4x__)->OCMRHUH) + (((uint32_t)(__CH__)) << 2UL)))
#define TMR4_OCERx(__TMR4x__, __CH__)       ((__IO uint16_t *)(REG_ADDR((__TMR4x__)->OCERU) + ((((uint32_t)(__CH__)) & 0x06UL) << 1UL)))
#define TMR4_OCSRx(__TMR4x__, __CH__)       ((__IO uint16_t *)(REG_ADDR((__TMR4x__)->OCSRU) + ((((uint32_t)(__CH__)) & 0x06UL) << 1UL)))
/**
 * @}
 */

/**
 * @defgroup TMR4_OCSR_Bit_Mask TMR4_OCSR Bit Mask
 * @brief Get the specified TMR4_OCSR register bis value of the specified TMR4 OCO channel
 * @note __CH__ value is TMR4_OCO_xy (x=U/V/W, y=H/L)
 * @{
 */
#define TMR4_OCSR_OCEx_MASK(__CH__)         ((uint16_t)(((uint16_t)TMR4_OCSR_OCEH) << SHIFT_1BIT(__CH__)))
#define TMR4_OCSR_OCPx_MASK(__CH__)         ((uint16_t)(((uint16_t)TMR4_OCSR_OCPH) << SHIFT_1BIT(__CH__)))
#define TMR4_OCSR_OCIEx_MASK(__CH__)        ((uint16_t)(((uint16_t)TMR4_OCSR_OCIEH) << SHIFT_1BIT(__CH__)))
#define TMR4_OCSR_OCFx_MASK(__CH__)         ((uint16_t)(((uint16_t)TMR4_OCSR_OCFH) << SHIFT_1BIT(__CH__)))
#define TMR4_OCSR_MASK(__CH__)                                                 \
(   (uint16_t)((uint16_t)(TMR4_OCSR_OCEH | TMR4_OCSR_OCPH | TMR4_OCSR_OCIEH | TMR4_OCSR_OCFH)) << SHIFT_1BIT(__CH__))
/**
 * @}
 */

/**
 * @defgroup TMR4_OCSR_Bit TMR4_OCSR Bit
 * @brief Get the specified TMR4_OCSR register bis value of the specified TMR4 OCO channel
 * @note __CH__ value is TMR4_OCO_xy (x=U/V/W, y=H/L)
 * @{
 */
#define TMR4_OCSR_OCEx(__CH__,__OCEx__)     ((uint16_t)(((uint16_t)__OCEx__) << SHIFT_1BIT(__CH__)))
#define TMR4_OCSR_OCPx(__CH__,__OCPx__)     ((uint16_t)(((uint16_t)__OCPx__) << SHIFT_1BIT(__CH__)))
#define TMR4_OCSR_OCIEx(__CH__,__OCIEx__)   ((uint16_t)(((uint16_t)__OCIEx__) << SHIFT_1BIT(__CH__)))
#define TMR4_OCSR_OCFx(__CH__,__OCFx__)     ((uint16_t)(((uint16_t)__OCFx__) << SHIFT_1BIT(__CH__)))
/**
 * @}
 */

/**
 * @defgroup TMR4_OCER_Bit_Mask TMR4_OCER Bit Mask
 * @brief Get the specified TMR4_OCER register bis value of the specified TMR4 OCO channel
 * @note __CH__ value is TMR4_OCO_xy (x=U/V/W, y=H/L)
 * @{
 */
#define TMR4_OCER_CxBUFEN_MASK(__CH__)      ((uint16_t)(((uint16_t)TMR4_OCER_CHBUFEN) << SHIFT_2BIT(__CH__)))
#define TMR4_OCER_MxBUFEN_MASK(__CH__)      ((uint16_t)(((uint16_t)TMR4_OCER_MHBUFEN) << SHIFT_2BIT(__CH__)))
#define TMR4_OCER_LMCx_MASK(__CH__)         ((uint16_t)(((uint16_t)TMR4_OCER_LMCH) << SHIFT_1BIT(__CH__)))
#define TMR4_OCER_LMMx_MASK(__CH__)         ((uint16_t)(((uint16_t)TMR4_OCER_LMMH) << SHIFT_1BIT(__CH__)))
#define TMR4_OCER_MCECx_MASK(__CH__)        ((uint16_t)(((uint16_t)TMR4_OCER_MCECH) << SHIFT_1BIT(__CH__)))
#define TMR4_OCER_MASK(__CH__)                                                 \
(   (uint16_t)(((uint16_t)(TMR4_OCER_CHBUFEN | TMR4_OCER_MHBUFEN)) << SHIFT_2BIT(__CH__)) | \
    (uint16_t)(((uint16_t)(TMR4_OCER_LMCH | TMR4_OCER_LMMH | TMR4_OCER_MCECH)) << SHIFT_2BIT(__CH__)))
/**
 * @}
 */

/**
 * @defgroup TMR4_OCER_Bit TMR4_OCER Bit
 * @brief Get the specified TMR4_OCER register bis value of the specified TMR4 OCO channel
 * @note __CH__ value is TMR4_OCO_xy (x=U/V/W, y=H/L)
 * @{
 */
#define TMR4_OCER_CxBUFEN(__CH__,__CxBUFEN__)   ((uint16_t)((__CxBUFEN__) << SHIFT_2BIT(__CH__)))
#define TMR4_OCER_MxBUFEN(__CH__,__MxBUFEN__)   ((uint16_t)((__MxBUFEN__) << SHIFT_2BIT(__CH__)))
#define TMR4_OCER_LMCx(__CH__,__LMCx__)         ((uint16_t)((__LMCx__) << SHIFT_1BIT(__CH__)))
#define TMR4_OCER_LMMx(__CH__,__LMMx__)         ((uint16_t)((__LMMx__) << SHIFT_1BIT(__CH__)))
#define TMR4_OCER_MCECx(__CH__,__MCECx__)       ((uint16_t)((__MCECx__) << SHIFT_1BIT(__CH__)))
/**
 * @}
 */

/**
 * @defgroup TMR4_PWM_Register TMR4 PWM Register
 * @brief Get the specified PWM register address of the specified TMR4 unit
 * @note __CH__ value is TMR4_PWM_x (x=U/V/W)
 * @{
 */
#define TMR4_RCSRx(__TMR4x__)               ((__IO uint16_t *)(REG_ADDR((__TMR4x__)->RCSR)))
#define TMR4_POCRx(__TMR4x__, __CH__)       ((__IO uint16_t *)(REG_ADDR((__TMR4x__)->POCRU) + (((uint32_t)(__CH__)) << 2UL)))
#define TMR4_PDARx(__TMR4x__, __CH__)       ((__IO uint16_t *)(REG_ADDR((__TMR4x__)->PDARU) + (((uint32_t)(__CH__)) << 3UL)))
#define TMR4_PDBRx(__TMR4x__, __CH__)       ((__IO uint16_t *)(REG_ADDR((__TMR4x__)->PDBRU) + (((uint32_t)(__CH__)) << 3UL)))
#define TMR4_PFSRx(__TMR4x__, __CH__)       ((__IO uint16_t *)(REG_ADDR((__TMR4x__)->PFSRU) + (((uint32_t)(__CH__)) << 3UL)))
/**
 * @}
 */

/**
 * @defgroup TMR4_RCSR_Bit_Mask TMR4_RCSR Bit Mask
 * @brief Get the specified TMR4_RCSR register bis value of the specified TMR4 PWM channel
 * @note __CH__ value is TMR4_PWM_x (x=U/V/W)
 * @{
 */
#define TMR4_RCSR_RTIDx_MASK(__CH__)        ((uint16_t)(((uint16_t)TMR4_RCSR_RTIDU) << (__CH__)))
#define TMR4_RCSR_RTIFx_MASK(__CH__)        ((uint16_t)(((uint16_t)TMR4_RCSR_RTIFU) << ((__CH__) << 2UL)))
#define TMR4_RCSR_RTICx_MASK(__CH__)        ((uint16_t)(((uint16_t)TMR4_RCSR_RTICU) << ((__CH__) << 2UL)))
#define TMR4_RCSR_RTEx_MASK(__CH__)         ((uint16_t)(((uint16_t)TMR4_RCSR_RTEU) << ((__CH__) << 2UL)))
#define TMR4_RCSR_RTSx_MASK(__CH__)         ((uint16_t)(((uint16_t)TMR4_RCSR_RTSU) << ((__CH__) << 2UL)))
/**
 * @}
 */

/**
 * @defgroup TMR4_PSCR_Bit_Mask TMR4_PSCR Bit Mask
 * @brief Get the specified TMR4_PSCR register bis value of the specified TMR4 PWM port channel
 * @note __PORT__ value is TMR4_PWM_PORT_Oxy (x=U/V/W, y=H/L)
 * @{
 */
#define TMR4_PSCR_OExy_MASK(__PORT__)       (TMR4_PSCR_OEUH << (__PORT__))
#define TMR4_PSCR_OSxy_MASK(__PORT__)       (TMR4_PSCR_OSUH << ((__PORT__) * 2UL))
/**
 * @}
 */

/**
 * @defgroup TMR4_PSCR_Bit TMR4_PSCR Bit
 * @brief Get the specified TMR4_PSCR register bis value of the specified TMR4 PWM port channel
 * @note __PORT__ value is TMR4_PWM_PORT_Oxy (x=U/V/W, y=H/L)
 * @{
 */
#define TMR4_PSCR_OExy(__PORT__, __OExy__)  ((__OExy__) << (__PORT__))
#define TMR4_PSCR_OSxy(__PORT__, __OSxy__)  ((__OSxy__) << ((__PORT__) * 2UL))
/**
 * @}
 */

/**
 * @defgroup TMR4_SEVT_Register TMR4 SEVT Register
 * @brief Get the specified SEVT register address of the specified TMR4 unit
 * @note __CH__ value is TMR4_SEVT_xy (x=U/V/W, y=H/L)
 * @{
 */
#define TMR4_SCCRx(__TMR4x__, __CH__)       ((__IO uint16_t *)(REG_ADDR((__TMR4x__)->SCCRUH) + ((__CH__) << 2UL)))
#define TMR4_SCSRx(__TMR4x__, __CH__)       ((__IO uint16_t *)(REG_ADDR((__TMR4x__)->SCSRUH) + ((__CH__) << 2UL)))
#define TMR4_SCMRx(__TMR4x__, __CH__)       ((__IO uint16_t *)(REG_ADDR((__TMR4x__)->SCMRUH) + ((__CH__) << 2UL)))
/**
 * @}
 */

/**
 * @}
 */

