levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmr4.c
    if (NULL == pu16MaskTimes)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));

        switch (u16IntSource)
        {
            case TMR4_CNT_INT_ZERO:
                *pu16MaskTimes = (uint16_t)(READ_REG16_BIT(TMR4x->CVPR, TMR4_CVPR_ZIM)  >> TMR4_CVPR_ZIM_POS);
                break;
            case TMR4_CNT_INT_PEAK:
                *pu16MaskTimes = (uint16_t)(READ_REG16_BIT(TMR4x->CVPR, TMR4_CVPR_PIM) >> TMR4_CVPR_PIM_POS);
                break;
            default:
                DDL_ASSERT(NULL);
                enRet = ErrorInvalidParameter;
                break;
        }
    }

    return enRet;
}

/**
 * @brief  Get TMR4 CNT interrupt mask current times
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u16IntSource            TMR4 interrupt source
 *         This parameter can be one of the following values:
 *           @arg TMR4_CNT_INT_PEAK:    Overflow interrupt
 *           @arg TMR4_CNT_INT_ZERO:    Underflow interrupt
 * @param  [out] pu16MaskTimes          The pointer for mask times
 *         This parameter can be one of the following values:
 *           @arg TMR4_CNT_INT_MASK_0:  Counter interrupt flag is always set(not masked) for every counter count at "0x0000" or peak
 *           @arg TMR4_CNT_INT_MASK_1:  Counter interrupt flag is set once for 2 every counter counts at "0x0000" or peak (skiping 1 count)
 *           @arg TMR4_CNT_INT_MASK_2:  Counter interrupt flag is set once for 3 every counter counts at "0x0000" or peak (skiping 2 count)
 *           @arg TMR4_CNT_INT_MASK_3:  Counter interrupt flag is set once for 4 every counter counts at "0x0000" or peak (skiping 3 count)
 *           @arg TMR4_CNT_INT_MASK_4:  Counter interrupt flag is set once for 5 every counter counts at "0x0000" or peak (skiping 4 count)
 *           @arg TMR4_CNT_INT_MASK_5:  Counter interrupt flag is set once for 6 every counter counts at "0x0000" or peak (skiping 5 count)
 *           @arg TMR4_CNT_INT_MASK_6:  Counter interrupt flag is set once for 7 every counter counts at "0x0000" or peak (skiping 6 count)
 *           @arg TMR4_CNT_INT_MASK_7:  Counter interrupt flag is set once for 8 every counter counts at "0x0000" or peak (skiping 7 count)
 *           @arg TMR4_CNT_INT_MASK_8:  Counter interrupt flag is set once for 9 every counter counts at "0x0000" or peak (skiping 8 count)
 *           @arg TMR4_CNT_INT_MASK_9:  Counter interrupt flag is set once for 10 every counter counts at "0x0000" or peak (skiping 9 count)
 *           @arg TMR4_CNT_INT_MASK_10: Counter interrupt flag is set once for 11 every counter counts at "0x0000" or peak (skiping 10 count)
 *           @arg TMR4_CNT_INT_MASK_11: Counter interrupt flag is set once for 12 every counter counts at "0x0000" or peak (skiping 11 count)
 *           @arg TMR4_CNT_INT_MASK_12: Counter interrupt flag is set once for 13 every counter counts at "0x0000" or peak (skiping 12 count)
 *           @arg TMR4_CNT_INT_MASK_13: Counter interrupt flag is set once for 14 every counter counts at "0x0000" or peak (skiping 13 count)
 *           @arg TMR4_CNT_INT_MASK_14: Counter interrupt flag is set once for 15 every counter counts at "0x0000" or peak (skiping 14 count)
 *           @arg TMR4_CNT_INT_MASK_15: Counter interrupt flag is set once for 16 every counter counts at "0x0000" or peak (skiping 15 count)
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: pu16MaskTimes = NULL or u16IntSource value is invalid
 */
en_result_t TMR4_CNT_GetIntMaskCurrentTimes(const M4_TMR4_TypeDef *TMR4x,
                                                    uint16_t u16IntSource,
                                                    uint16_t *pu16MaskTimes)
{
    en_result_t enRet = Ok;

    if (NULL == pu16MaskTimes)
    {
        enRet = ErrorInvalidParameter;
    }
    else
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));

        switch (u16IntSource)
        {
            case TMR4_CNT_INT_ZERO:
                *pu16MaskTimes = (uint16_t)(READ_REG16_BIT(TMR4x->CVPR, TMR4_CVPR_ZIC) >> TMR4_CVPR_ZIC_POS);
                break;
            case TMR4_CNT_INT_PEAK:
                *pu16MaskTimes = (uint16_t)(READ_REG16_BIT(TMR4x->CVPR, TMR4_CVPR_PIC) >> TMR4_CVPR_PIC_POS);
                break;
            default:
                DDL_ASSERT(NULL);
                enRet = ErrorInvalidParameter;
                break;
        }
    }

    return enRet;
}

/**
 * @brief  Set TMR4 count direction signal output to port
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] enNewState          The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR4_CNT_PortOutputDirSigCmd(M4_TMR4_TypeDef *TMR4x,
                                        en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    if (Enable == enNewState)
    {
        SET_REG16_BIT(TMR4x->SCER, TMR4_SCER_PCTS);
    }
    else
    {
        CLEAR_REG16_BIT(TMR4x->SCER, TMR4_SCER_PCTS);
    }
}

/**
 * @}
 */

/**
 * @defgroup TMR4_OCO_Global_Functions TMR4 OCO Global Functions
 * @{
 */

/**
 * @brief  Initialize TMR4 OCO
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @param  [in] pstcInit            Pointer to a @ref stc_tmr4_oco_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: u32Ch is invalid or pstcInit = NULL
 */
en_result_t TMR4_OCO_Init(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                const stc_tmr4_oco_init_t *pstcInit)
{
    uint16_t u16Val;
    __IO uint16_t *TMR4_OCER;
    __IO uint16_t *TMR4_OCSR;
    __IO uint16_t *TMR4_OCCR;
    en_result_t enRet = ErrorInvalidParameter;

