levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmr4.c
    /* Check pointer */
    if (NULL != pstcMode)
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
        DDL_ASSERT(IS_VALID_TMR4_OCO_HIGH_CH(u32Ch));
        DDL_ASSERT(IS_VALID_TMR4_OCO_EXTEND_MATCH(pstcMode->u16ExtendMatch));

        /* Get pointer of current channel OCO register address */
        TMR4_OCER = TMR4_OCERx(TMR4x, u32Ch);
        TMR4_OCMRxH = TMR4_OCMRx(TMR4x, u32Ch);

        WRITE_REG16(*TMR4_OCMRxH, pstcMode->OCMRx);
        MODIFY_REG16(*TMR4_OCER, \
                     TMR4_OCER_MCECx_MASK(u32Ch), \
                     TMR4_OCER_MCECx(u32Ch, pstcMode->u16ExtendMatch));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the TMR4 OCO low channel mode
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 OCO channel.
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 * @param  [in] pstcMode            Pointer to a @ref stc_oco_low_ch_compare_mode_t structure of the TMR4 OCO low channel mode
 * @retval An en_result_t enumeration value:
 *           - Ok: Set successfully
 *           - ErrorInvalidParameter: pstcMode = NULL
 */
en_result_t TMR4_OCO_SetLowChCompareMode(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                const stc_oco_low_ch_compare_mode_t *pstcMode)
{
    __IO uint16_t *TMR4_OCER;
    __IO uint32_t *TMR4_OCMRxL;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check pointer */
    if (NULL != pstcMode)
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
        DDL_ASSERT(IS_VALID_TMR4_OCO_LOW_CH(u32Ch));
        DDL_ASSERT(IS_VALID_TMR4_OCO_EXTEND_MATCH(pstcMode->u16ExtendMatch));

        /* Get pointer of current channel OCO register address */
        TMR4_OCER = TMR4_OCERx(TMR4x, u32Ch);
        TMR4_OCMRxL = (__IO uint32_t*)((uint32_t)TMR4_OCMRx(TMR4x, u32Ch));

        WRITE_REG32(*TMR4_OCMRxL, pstcMode->OCMRx);
        MODIFY_REG16(*TMR4_OCER, \
                     TMR4_OCER_MCECx_MASK(u32Ch), \
                     TMR4_OCER_MCECx(u32Ch, pstcMode->u16ExtendMatch));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the TMR4 OCO low channel mode
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @param  [in] u16OcoCmd           The function new state
 *           @arg TMR4_OCO_DISABLE: Disable TMR4 OCO function
 *           @arg TMR4_OCO_ENABLE: Enable TMR4 OCO function
 * @retval None
 */
void TMR4_OCO_SetOutputCompare(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16OcoCmd)
{
    __IO uint16_t *TMR4_OCSR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));
    DDL_ASSERT(IS_VALID_TMR4_OCO_STATE(u16OcoCmd));

    /* Get pointer of current channel OCO register address */
    TMR4_OCSR = TMR4_OCSRx(TMR4x, u32Ch);

    /* Set OCSR port output compare */
    MODIFY_REG16(*TMR4_OCSR, \
                 TMR4_OCSR_OCEx_MASK(u32Ch), \
                 TMR4_OCSR_OCEx(u32Ch, u16OcoCmd));
}

/**
 * @brief  Set the TMR4 OCO interrupt function
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @param  [in] enNewState          The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR4_OCO_IntCmd(M4_TMR4_TypeDef *TMR4x,
                            uint32_t u32Ch,
                            en_functional_state_t enNewState)
{
    __IO uint16_t *TMR4_OCSR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

    /* Get pointer of current channel OCO register address */
    TMR4_OCSR = TMR4_OCSRx(TMR4x, u32Ch);

    if (Enable == enNewState)
    {
        SET_REG16_BIT(*TMR4_OCSR, TMR4_OCSR_OCIEx(u32Ch, TMR4_OCSR_OCIEH));
    }
    else
    {
        CLEAR_REG16_BIT(*TMR4_OCSR, TMR4_OCSR_OCIEx(u32Ch, TMR4_OCSR_OCIEH));
    }
}

/**
 * @brief  Set the TMR4 OCO interrupt flag
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @retval An en_flag_status_t enumeration value:
 *           - Reset:               None interrupt request flag is set on TMR4 OCO
 *           - Set:                 Detection interrupt request on TMR4 OCO
 */
en_flag_status_t TMR4_OCO_GetStatus(const M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch)
{
    __IO uint16_t *TMR4_OCSR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));

    /* Get pointer of current channel OCO register address */
    TMR4_OCSR = TMR4_OCSRx(TMR4x, u32Ch);

    return (READ_REG16_BIT(*TMR4_OCSR, TMR4_OCSR_OCFx(u32Ch, TMR4_OCSR_OCFH)) ? Set : Reset);
}

/**
 * @brief  Clear the TMR4 OCO interrupt function
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @retval None
 */
void TMR4_OCO_ClearStatus(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch)
{
    __IO uint16_t *TMR4_OCSR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));

    /* Get pointer of current channel OCO register address */
    TMR4_OCSR = TMR4_OCSRx(TMR4x, u32Ch);

    /* Clear OCSR count compare flag */
    CLEAR_REG16_BIT(*TMR4_OCSR, TMR4_OCSR_OCFx(u32Ch, TMR4_OCSR_OCFH));
}

/**
 * @brief  Set TMR4 OCO invalid output polarity
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @param  [in] u16OutputPolarity   TMR4 OCO invalid output polarity.
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_INVAILD_OP_LOW:    TMR4 OCO output low level when OCO is invalid
 *           @arg TMR4_OCO_INVAILD_OP_HIGH:   TMR4 OCO output high level when OCO is invalid
 * @retval None
 */
void TMR4_OCO_SetOcoInvalidOp(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16OutputPolarity)
{
    __IO uint16_t *TMR4_OCSR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));
    DDL_ASSERT(IS_VALID_TMR4_OCO_PORT_INVALID_OP(u16OutputPolarity));

    /* Get pointer of current channel OCO register address */
    TMR4_OCSR = TMR4_OCSRx(TMR4x, u32Ch);

    /* Set OCSR register: OCO invalid output polarity */
    MODIFY_REG16(*TMR4_OCSR, \
                 TMR4_OCSR_OCPx_MASK(u32Ch), \
                 TMR4_OCSR_OCPx(u32Ch, u16OutputPolarity));
}

/**
 * @brief  Get TMR4 OCO output polarity
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @retval Returned value can be one of the following values:
 *           @arg TMR4_OCO_INVAILD_OP_LOW:    TMR4 OCO output low level when OCO is invalid
 *           @arg TMR4_OCO_INVAILD_OP_HIGH:   TMR4 OCO output high level when OCO is invalid
 */
uint16_t TMR4_OCO_GetOutputPolarity(const M4_TMR4_TypeDef *TMR4x,
                                                uint32_t u32Ch)
{
    uint16_t u16OutputPolarity;
    __IO uint16_t *TMR4_OCSR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));

    /* Get pointer of current channel OCO register address */
    TMR4_OCSR = TMR4_OCSRx(TMR4x, u32Ch);

    /* Get OCSR register: OCO output polarity */
    u16OutputPolarity = READ_REG16_BIT(*TMR4_OCSR, TMR4_OCSR_OCPx_MASK(u32Ch));

    return (u16OutputPolarity >> SHIFT_1BIT(u32Ch));
}

/**
 * @brief  Set TMR4 OCO compare value
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @param  [in] u16CompareVal          The TMR4 OCO OCCR register value
 *           @arg number of 16bit
 * @retval None
 */
void TMR4_OCO_SetCompareVal(M4_TMR4_TypeDef *TMR4x,
                                    uint32_t u32Ch,
                                    uint16_t u16CompareVal)
{
    __IO uint16_t *TMR4_OCCR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));

    /* Get pointer of current channel OCO register address */
    TMR4_OCCR = TMR4_OCCRx(TMR4x, u32Ch);

    WRITE_REG16(*TMR4_OCCR, u16CompareVal);
}

/**
 * @brief  Get TMR4 OCO OCCR compare value
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 OCO channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_OCO_UH:      TMR4 OCO channel - UH
 *           @arg TMR4_OCO_UL:      TMR4 OCO channel - UL
 *           @arg TMR4_OCO_VH:      TMR4 OCO channel - VH
 *           @arg TMR4_OCO_VL:      TMR4 OCO channel - VL
 *           @arg TMR4_OCO_WH:      TMR4 OCO channel - WH
 *           @arg TMR4_OCO_WL:      TMR4 OCO channel - WL
 * @retval The OCCR register value of the TMR4 OCO
 */
uint16_t TMR4_OCO_GetCompareVal(const M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch)
{
    __IO uint16_t *TMR4_OCCR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_OCO_CH(u32Ch));

    /* Get pointer of current channel OCO register address */
    TMR4_OCCR = TMR4_OCCRx(TMR4x, u32Ch);

    return READ_REG16(*TMR4_OCCR);
}

/**
 * @}
 */

/**
 * @defgroup TMR4_PWM_Global_Functions TMR4 PWM Global Functions
 * @{
 */

/**
 * @brief  Initialize TMR4 PWM
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_U:       TMR4 PWM couple channel - U
 *           @arg TMR4_PWM_V:       TMR4 PWM couple channel - V
 *           @arg TMR4_PWM_W:       TMR4 PWM couple channel - W
 * @param  [in] pstcInit            Pointer to a @ref stc_tmr4_pwm_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: u32Ch is invalid or pstcInit = NULL
 */
en_result_t TMR4_PWM_Init(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                const stc_tmr4_pwm_init_t *pstcInit)
{
    __IO uint16_t *TMR4_POCR;
    __IO uint16_t *TMR4_RCSR;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check channel && structure pointer */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
        DDL_ASSERT(IS_VALID_TMR4_PWM_CH(u32Ch));
        DDL_ASSERT(IS_VALID_TMR4_PWM_MODE(pstcInit->u16Mode));
        DDL_ASSERT(IS_VALID_TMR4_PWM_PCLK_DIV(pstcInit->u16PclkDiv));
        DDL_ASSERT(IS_VALID_TMR4_PWM_TRANSFORM_OCO_POLARITY(pstcInit->u16TransformOcoPol));
        DDL_ASSERT(IS_VALID_TMR4_PWM_EMB_PORT_OUTPUT_STATE(pstcInit->u32EmbOxHPortState));
        DDL_ASSERT(IS_VALID_TMR4_PWM_EMB_PORT_OUTPUT_STATE(pstcInit->u32EmbOxLPortState));

        /* Get pointer of current channel PWM register address */
        TMR4_POCR = TMR4_POCRx(TMR4x, u32Ch);
        TMR4_RCSR = TMR4_RCSRx(TMR4x);

        /* Set POCR register */
        WRITE_REG16(*TMR4_POCR, (pstcInit->u16PclkDiv | pstcInit->u16Mode | pstcInit->u16TransformOcoPol));

        /* Set RCSR register */
        MODIFY_REG16(*TMR4_RCSR,
                      TMR4_RCSR_RTEx_MASK(u32Ch), \
                      (TMR4_RCSR_RTIDx_MASK(u32Ch) | TMR4_RCSR_RTSx_MASK(u32Ch) | TMR4_RCSR_RTICx_MASK(u32Ch)));

        /* Set PSCR register: PWM port state */
        MODIFY_REG32(TMR4x->PSCR, \
                     ((TMR4_PSCR_OEUH | TMR4_PSCR_OEUL) << (u32Ch * 2UL) | \
                      (TMR4_PSCR_OSUH | TMR4_PSCR_OSUL) << (u32Ch * 4UL)), \
                     ((pstcInit->u32OxHPortOutMode << (u32Ch * 2UL)) | \
                      (pstcInit->u32OxLPortOutMode << (u32Ch * 2UL + 1UL)) | \
                      (pstcInit->u32EmbOxHPortState << (u32Ch * 4UL)) | \
                      (pstcInit->u32EmbOxLPortState << (u32Ch * 4UL + 2UL))));
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_tmr4_pwm_init_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_tmr4_pwm_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t TMR4_PWM_StructInit(stc_tmr4_pwm_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

