levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmr4.c
    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u16Mode = TMR4_PWM_THROUGH_MODE;
        pstcInit->u16PclkDiv = TMR4_PWM_PCLK_DIV1;
        pstcInit->u16TransformOcoPol = TMR4_PWM_OP_OXH_HOLD_OXL_HOLD;
        pstcInit->u32OxHPortOutMode = TMR4_PWM_PORT_OUTPUT_OSxy;
        pstcInit->u32EmbOxHPortState = TMR4_PWM_EMB_PORT_OUTPUT_NORMAL;
        pstcInit->u32OxLPortOutMode = TMR4_PWM_PORT_OUTPUT_OSxy;
        pstcInit->u32EmbOxLPortState = TMR4_PWM_EMB_PORT_OUTPUT_NORMAL;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-initialize TMR4 PWM
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_U:       TMR4 PWM couple channel - U
 *           @arg TMR4_PWM_V:       TMR4 PWM couple channel - V
 *           @arg TMR4_PWM_W:       TMR4 PWM couple channel - W
 * @retval None
 */
void TMR4_PWM_DeInit(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch)
{
    __IO uint16_t *TMR4_POCR;
    __IO uint16_t *TMR4_RCSR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_CH(u32Ch));

    /* Get pointer of current channel PWM register address */
    TMR4_POCR = TMR4_POCRx(TMR4x, u32Ch);
    TMR4_RCSR = TMR4_RCSRx(TMR4x);

    /* Set POCR register */
    WRITE_REG16(*TMR4_POCR, (TMR4_PWM_PCLK_DIV1 | \
                             TMR4_PWM_THROUGH_MODE | \
                             TMR4_PWM_OP_OXH_HOLD_OXL_HOLD));

    /* Set RCSR register */
    MODIFY_REG16(*TMR4_RCSR,
                  TMR4_RCSR_RTEx_MASK(u32Ch), \
                  (TMR4_RCSR_RTIDx_MASK(u32Ch) | \
                   TMR4_RCSR_RTSx_MASK(u32Ch) | \
                   TMR4_RCSR_RTICx_MASK(u32Ch)));
}

/**
 * @brief  Set TMR4 PWM PCLK clock division
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_U:       TMR4 PWM couple channel - U
 *           @arg TMR4_PWM_V:       TMR4 PWM couple channel - V
 *           @arg TMR4_PWM_W:       TMR4 PWM couple channel - W
 * @param  [in] u16Div                  TMR4 PWM PCLK clock division
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_PCLK_DIV1:    PCLK
 *           @arg TMR4_PWM_PCLK_DIV2:    PCLK/2
 *           @arg TMR4_PWM_PCLK_DIV4:    PCLK/4
 *           @arg TMR4_PWM_PCLK_DIV8:    PCLK/8
 *           @arg TMR4_PWM_PCLK_DIV16:   PCLK/16
 *           @arg TMR4_PWM_PCLK_DIV32:   PCLK/32
 *           @arg TMR4_PWM_PCLK_DIV64:   PCLK/64
 *           @arg TMR4_PWM_PCLK_DIV128:  PCLK/128
 * @retval None
 * @note   The PCLK division function is valid when clock source is PCLK
 */
void TMR4_PWM_SetPclkDiv(M4_TMR4_TypeDef *TMR4x,
                                uint32_t u32Ch,
                                uint16_t u16Div)
{
    __IO uint16_t *TMR4_POCR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_CH(u32Ch));
    DDL_ASSERT(IS_VALID_TMR4_CNT_PCLK_DIV(u16Div));

    /* Get pointer of current channel PWM register address */
    TMR4_POCR = TMR4_POCRx(TMR4x, u32Ch);
    MODIFY_REG16(*TMR4_POCR, TMR4_POCR_DIVCK, u16Div);
}

/**
 * @brief  Get TMR4 PWM PCLK clock division
 * @param  [in] TMR4x                   Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_U:       TMR4 PWM couple channel - U
 *           @arg TMR4_PWM_V:       TMR4 PWM couple channel - V
 *           @arg TMR4_PWM_W:       TMR4 PWM couple channel - W
 * @retval Returned value can be one of the following values:
 *           @arg TMR4_PWM_PCLK_DIV1:    PCLK
 *           @arg TMR4_PWM_PCLK_DIV2:    PCLK/2
 *           @arg TMR4_PWM_PCLK_DIV4:    PCLK/4
 *           @arg TMR4_PWM_PCLK_DIV8:    PCLK/8
 *           @arg TMR4_PWM_PCLK_DIV16:   PCLK/16
 *           @arg TMR4_PWM_PCLK_DIV32:   PCLK/32
 *           @arg TMR4_PWM_PCLK_DIV64:   PCLK/64
 *           @arg TMR4_PWM_PCLK_DIV128:  PCLK/128
 * @note   The PCLK division function is valid when clock source is PCLK
 */
uint16_t TMR4_PWM_GetPclkDiv(const M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch)
{
    __IO uint16_t *TMR4_POCR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_CH(u32Ch));

    /* Get pointer of current channel PWM register address */
    TMR4_POCR = TMR4_POCRx(TMR4x, u32Ch);
    return READ_REG16_BIT(*TMR4_POCR, TMR4_POCR_DIVCK);
}

/**
 * @brief  Set TMR4 PWM output polarity transform
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_U:       TMR4 PWM couple channel - U
 *           @arg TMR4_PWM_V:       TMR4 PWM couple channel - V
 *           @arg TMR4_PWM_W:       TMR4 PWM couple channel - W
 * @param  [in] u16OcoPolTransform  TMR4 PWM transform OCO polarity
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_OP_OXH_HOLD_OXL_HOLD:      Output PWML and PWMH signals without changing the level
 *           @arg TMR4_PWM_OP_OXH_INVERT_OXL_INVERT:  Output both PWML and PWMH signals reversed
 *           @arg TMR4_PWM_OP_OXH_INVERT_OXL_HOLD:    Output the PWMH signal reversed, outputs the PWML signal without changing the level
 *           @arg TMR4_PWM_OP_OXH_HOLD_OXL_INVERT:    Output the PWMH signal without changing the level, Outputs the PWML signal reversed
 * @retval None
 */
void TMR4_PWM_SetOcoPolarityTransform(M4_TMR4_TypeDef *TMR4x,
                                                uint32_t u32Ch,
                                                uint16_t u16OcoPolTransform)
{
    __IO uint16_t *TMR4_POCR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_CH(u32Ch));
    DDL_ASSERT(IS_VALID_TMR4_PWM_TRANSFORM_OCO_POLARITY(u16OcoPolTransform));

    /* Get pointer of current channel PWM register address */
    TMR4_POCR = TMR4_POCRx(TMR4x, u32Ch);

    MODIFY_REG16(*TMR4_POCR, TMR4_POCR_LVLS, u16OcoPolTransform);
}

/**
 * @brief  Get TMR4 PWM output polarity transform
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_U:       TMR4 PWM couple channel - U
 *           @arg TMR4_PWM_V:       TMR4 PWM couple channel - V
 *           @arg TMR4_PWM_W:       TMR4 PWM couple channel - W
 * @retval Returned value can be one of the following values:
 *           @arg TMR4_PWM_OP_OXH_HOLD_OXL_HOLD:      Output PWML and PWMH signals without changing the level
 *           @arg TMR4_PWM_OP_OXH_INVERT_OXL_INVERT:  Output both PWML and PWMH signals reversed
 *           @arg TMR4_PWM_OP_OXH_INVERT_OXL_HOLD:    Output the PWMH signal reversed, outputs the PWML signal without changing the level
 *           @arg TMR4_PWM_OP_OXH_HOLD_OXL_INVERT:    Output the PWMH signal without changing the level, Outputs the PWML signal reversed
 */
uint16_t TMR4_PWM_GetOcoPolarityTransform(const M4_TMR4_TypeDef *TMR4x,
                                                    uint32_t u32Ch)
{
    __IO uint16_t *TMR4_POCR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_CH(u32Ch));

    /* Get pointer of current channel PWM register address */
    TMR4_POCR = TMR4_POCRx(TMR4x, u32Ch);

    return READ_REG16_BIT(*TMR4_POCR, TMR4_POCR_LVLS);
}

/**
 * @brief  Start TMR4 PWM reload-timer
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_U:       TMR4 PWM couple channel - U
 *           @arg TMR4_PWM_V:       TMR4 PWM couple channel - V
 *           @arg TMR4_PWM_W:       TMR4 PWM couple channel - W
 * @retval None
 */
void TMR4_PWM_StartReloadTimer(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_CH(u32Ch));

    SET_REG16_BIT(TMR4x->RCSR, TMR4_RCSR_RTEx_MASK(u32Ch));
}

/**
 * @brief  Stop TMR4 PWM reload-timer
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_U:       TMR4 PWM couple channel - U
 *           @arg TMR4_PWM_V:       TMR4 PWM couple channel - V
 *           @arg TMR4_PWM_W:       TMR4 PWM couple channel - W
 * @retval None
 */
void TMR4_PWM_StopReloadTimer(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_CH(u32Ch));

    SET_REG16_BIT(TMR4x->RCSR, TMR4_RCSR_RTSx_MASK(u32Ch));
}

/**
 * @brief  Set the TMR4 PWM interrupt function
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 PWM channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_PWM_U:       TMR4 PWM couple channel - U
 *           @arg TMR4_PWM_V:       TMR4 PWM couple channel - V
 *           @arg TMR4_PWM_W:       TMR4 PWM couple channel - W
 * @param  [in] enNewState          The function new state
 *           @arg  This parameter can be: Enable or Disable
 * @retval None
 */
void TMR4_PWM_IntCmd(M4_TMR4_TypeDef *TMR4x,
                            uint32_t u32Ch,
                            en_functional_state_t enNewState)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_PWM_CH(u32Ch));
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));

