levizh/hc32m423_dev/Firmware/00_ddl/hc32m423_ddl/driver/src/hc32m423_tmr4.c
    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        /* Check parameters */
        DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
        DDL_ASSERT(IS_VALID_TMR4_SEVT_CH(u32Ch));
        DDL_ASSERT(IS_VALID_TMR4_SEVT_MODE(pstcInit->u16Mode));
        DDL_ASSERT(IS_VALID_TMR4_SEVT_LINK_TRANSFER(pstcInit->u16LinkTransfer));
        DDL_ASSERT(IS_VALID_TMR4_SEVT_OUTPUT_EVENT(pstcInit->u16OutpuEvent));
        DDL_ASSERT(IS_VALID_TMR4_SEVT_BUF_MODE(pstcInit->u16BufMode));
        DDL_ASSERT(IS_VALID_TMR4_SEVT_UP_SEL(pstcInit->u16UpMatchCmd));
        DDL_ASSERT(IS_VALID_TMR4_SEVT_DOWN_SEL(pstcInit->u16DownMatchCmd));
        DDL_ASSERT(IS_VALID_TMR4_SEVT_PEAK_SEL(pstcInit->u16PeakMatchCmd));
        DDL_ASSERT(IS_VALID_TMR4_SEVT_ZERO_SEL(pstcInit->u16ZeroMatchCmd));
        DDL_ASSERT(IS_VALID_TMR4_SEVT_ZERO_MATCH_MASK_SEL(pstcInit->u16ZeroMatchMaskCmd));
        DDL_ASSERT(IS_VALID_TMR4_SEVT_PEAK_MATCH_MASK_SEL(pstcInit->u16PeakMatchMaskCmd));
        DDL_ASSERT(IS_VALID_TMR4_SEVT_MASK(pstcInit->u16MaskTimes));

        /* Get actual address of register list of current channel */
        TMR4_SCCR = TMR4_SCCRx(TMR4x, u32Ch);
        TMR4_SCSR = TMR4_SCSRx(TMR4x, u32Ch);
        TMR4_SCMR = TMR4_SCMRx(TMR4x, u32Ch);

        /* Configure default parameter */
        WRITE_REG16(*TMR4_SCSR, 0x0000U);
        WRITE_REG16(*TMR4_SCMR, 0xFF00U);

        /* Set SCSR register */
        WRITE_REG16(*TMR4_SCSR,             \
                    (pstcInit->u16Mode    | \
                     pstcInit->u16OutpuEvent | \
                     pstcInit->u16BufMode | \
                     pstcInit->u16LinkTransfer | \
                     pstcInit->u16DownMatchCmd | \
                     pstcInit->u16PeakMatchCmd | \
                     pstcInit->u16UpMatchCmd | \
                     pstcInit->u16ZeroMatchCmd));

        /* Set SCMR register */
        WRITE_REG16(*TMR4_SCMR, \
                    (pstcInit->u16MaskTimes | \
                     pstcInit->u16ZeroMatchMaskCmd | \
                     pstcInit->u16PeakMatchMaskCmd));

        WRITE_REG16(*TMR4_SCCR, pstcInit->u16CompareVal);
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  Set the fields of structure stc_tmr4_pwm_init_t to default values
 * @param  [out] pstcInit               Pointer to a @ref stc_tmr4_pwm_init_t structure
 * @retval An en_result_t enumeration value:
 *           - Ok: Initialize successfully
 *           - ErrorInvalidParameter: pstcInit = NULL
 */
en_result_t TMR4_SEVT_StructInit(stc_tmr4_sevt_init_t *pstcInit)
{
    en_result_t enRet = ErrorInvalidParameter;

    /* Check structure pointer */
    if (NULL != pstcInit)
    {
        pstcInit->u16CompareVal = 0U;
        pstcInit->u16Mode = TMR4_SEVT_MODE_COMPARE_TRIGGER;
        pstcInit->u16OutpuEvent = TMR4_SEVT_OUTPUT_EVENT0;
        pstcInit->u16BufMode = TMR4_SEVT_BUF_DISABLE;
        pstcInit->u16LinkTransfer = TMR4_SEVT_LINK_TRANSFER_DISABLE;
        pstcInit->u16DownMatchCmd = TMR4_SEVT_DOWN_DISABLE;
        pstcInit->u16PeakMatchCmd = TMR4_SEVT_PEAK_DISABLE;
        pstcInit->u16UpMatchCmd = TMR4_SEVT_UP_DISABLE;
        pstcInit->u16ZeroMatchCmd = TMR4_SEVT_ZERO_DISABLE;
        pstcInit->u16ZeroMatchMaskCmd = TMR4_SEVT_ZERO_MATCH_MASK_DISABLE;
        pstcInit->u16PeakMatchMaskCmd = TMR4_SEVT_PEAK_MATCH_MASK_DISABLE;
        pstcInit->u16MaskTimes = TMR4_SEVT_MASK_0;
        enRet = Ok;
    }

    return enRet;
}

/**
 * @brief  De-initialize TMR4 PWM
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_SEVT_UH:     TMR4 SEVT channel - UH
 *           @arg TMR4_SEVT_UL:     TMR4 SEVT channel - UL
 *           @arg TMR4_SEVT_VH:     TMR4 SEVT channel - VH
 *           @arg TMR4_SEVT_VL:     TMR4 SEVT channel - VL
 *           @arg TMR4_SEVT_WH:     TMR4 SEVT channel - WH
 *           @arg TMR4_SEVT_WL:     TMR4 SEVT channel - WL
 * @retval None
 */
void TMR4_SEVT_DeInit(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch)
{
    __IO uint16_t *TMR4_SCCR;
    __IO uint16_t *TMR4_SCSR;
    __IO uint16_t *TMR4_SCMR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_SEVT_CH(u32Ch));

    /* Get actual address of register list of current channel */
    TMR4_SCCR = TMR4_SCCRx(TMR4x, u32Ch);
    TMR4_SCSR = TMR4_SCSRx(TMR4x, u32Ch);
    TMR4_SCMR = TMR4_SCMRx(TMR4x, u32Ch);

    /* Configure default parameter */
    WRITE_REG16(*TMR4_SCCR, 0x0U);
    WRITE_REG16(*TMR4_SCSR, 0x0000U);
    WRITE_REG16(*TMR4_SCMR, 0xFF00U);
}

/**
 * @brief  Set TMR4 SEVT trigger event
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_SEVT_UH:     TMR4 SEVT channel - UH
 *           @arg TMR4_SEVT_UL:     TMR4 SEVT channel - UL
 *           @arg TMR4_SEVT_VH:     TMR4 SEVT channel - VH
 *           @arg TMR4_SEVT_VL:     TMR4 SEVT channel - VL
 *           @arg TMR4_SEVT_WH:     TMR4 SEVT channel - WH
 *           @arg TMR4_SEVT_WL:     TMR4 SEVT channel - WL
 * @param  [in] u16Event            TMR4 SEVT trigger event
 *         This parameter can be one of the following values:
 *           @arg TMR4_SEVT_OUTPUT_EVENT0: TMR4 SEVT output special event 0
 *           @arg TMR4_SEVT_OUTPUT_EVENT1: TMR4 SEVT output special event 1
 *           @arg TMR4_SEVT_OUTPUT_EVENT2: TMR4 SEVT output special event 2
 *           @arg TMR4_SEVT_OUTPUT_EVENT3: TMR4 SEVT output special event 3
 *           @arg TMR4_SEVT_OUTPUT_EVENT4: TMR4 SEVT output special event 4
 *           @arg TMR4_SEVT_OUTPUT_EVENT5: TMR4 SEVT output special event 5
 * @retval None
 */
void TMR4_SEVT_SetOutpuEvent(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16Event)
{
    __IO uint16_t *TMR4_SCSR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_SEVT_CH(u32Ch));
    DDL_ASSERT(IS_VALID_TMR4_SEVT_OUTPUT_EVENT(u16Event));

    /* Get actual address of register list of current channel */
    TMR4_SCSR = TMR4_SCSRx(TMR4x, u32Ch);

    /* Set SCSR register */
    MODIFY_REG16(*TMR4_SCSR, TMR4_SCSR_EVTOS, u16Event);
}

/**
 * @brief  Get TMR4 SEVT trigger event
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_SEVT_UH:     TMR4 SEVT channel - UH
 *           @arg TMR4_SEVT_UL:     TMR4 SEVT channel - UL
 *           @arg TMR4_SEVT_VH:     TMR4 SEVT channel - VH
 *           @arg TMR4_SEVT_VL:     TMR4 SEVT channel - VL
 *           @arg TMR4_SEVT_WH:     TMR4 SEVT channel - WH
 *           @arg TMR4_SEVT_WL:     TMR4 SEVT channel - WL
 * @retval Returned value can be one of the following values:
 *           @arg TMR4_SEVT_OUTPUT_EVENT0: TMR4 SEVT output special event 0
 *           @arg TMR4_SEVT_OUTPUT_EVENT1: TMR4 SEVT output special event 1
 *           @arg TMR4_SEVT_OUTPUT_EVENT2: TMR4 SEVT output special event 2
 *           @arg TMR4_SEVT_OUTPUT_EVENT3: TMR4 SEVT output special event 3
 *           @arg TMR4_SEVT_OUTPUT_EVENT4: TMR4 SEVT output special event 4
 *           @arg TMR4_SEVT_OUTPUT_EVENT5: TMR4 SEVT output special event 5
 */
uint16_t TMR4_SEVT_GetOutpuEvent(M4_TMR4_TypeDef *TMR4x, uint32_t u32Ch)
{
    __IO uint16_t *TMR4_SCSR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_SEVT_CH(u32Ch));

    /* Get actual address of register list of current channel */
    TMR4_SCSR = TMR4_SCSRx(TMR4x, u32Ch);
    return READ_REG16_BIT(*TMR4_SCSR, TMR4_SCSR_EVTOS);
}

/**
 * @brief  Set TMR4 SEVT delay object
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_SEVT_UH:     TMR4 SEVT channel - UH
 *           @arg TMR4_SEVT_UL:     TMR4 SEVT channel - UL
 *           @arg TMR4_SEVT_VH:     TMR4 SEVT channel - VH
 *           @arg TMR4_SEVT_VL:     TMR4 SEVT channel - VL
 *           @arg TMR4_SEVT_WH:     TMR4 SEVT channel - WH
 *           @arg TMR4_SEVT_WL:     TMR4 SEVT channel - WL
 * @param  [in] u16DelayObject      TMR4 SEVT delay object
 *         This parameter can be one of the following values:
 *           @arg TMR4_SEVT_DELAY_OCCRXH: TMR4 SEVT delay object - OCCRxh
 *           @arg TMR4_SEVT_DELAY_OCCRXL: TMR4 SEVT delay object - OCCRxl
 * @retval None
 */
void TMR4_SEVT_SetDelayObject(M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch,
                                        uint16_t u16DelayObject)
{
    __IO uint16_t *TMR4_SCSR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_SEVT_CH(u32Ch));
    DDL_ASSERT(IS_VALID_TMR4_SEVT_OBJECT(u16DelayObject));

    /* Get actual address of register list of current channel */
    TMR4_SCSR = TMR4_SCSRx(TMR4x, u32Ch);

    /* Set SCSR register */
    MODIFY_REG16(*TMR4_SCSR, TMR4_SCSR_EVTDS, u16DelayObject);
}

/**
 * @brief  Get TMR4 SEVT SCCR register value
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_SEVT_UH:     TMR4 SEVT channel - UH
 *           @arg TMR4_SEVT_UL:     TMR4 SEVT channel - UL
 *           @arg TMR4_SEVT_VH:     TMR4 SEVT channel - VH
 *           @arg TMR4_SEVT_VL:     TMR4 SEVT channel - VL
 *           @arg TMR4_SEVT_WH:     TMR4 SEVT channel - WH
 *           @arg TMR4_SEVT_WL:     TMR4 SEVT channel - WL
 * @retval Returned value can be one of the following values:
 *           @arg TMR4_SEVT_DELAY_OCCRXH: TMR4 SEVT delay object - OCCRxh
 *           @arg TMR4_SEVT_DELAY_OCCRXL: TMR4 SEVT delay object - OCCRxl
 */
uint16_t TMR4_SEVT_GetDelayObject(const M4_TMR4_TypeDef *TMR4x,
                                            uint32_t u32Ch)
{
    __IO uint16_t *TMR4_SCSR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_SEVT_CH(u32Ch));

    /* Get actual address of register list of current channel */
    TMR4_SCSR = TMR4_SCSRx(TMR4x, u32Ch);

    return READ_REG16_BIT(*TMR4_SCSR, TMR4_SCSR_EVTDS);
}

/**
 * @brief  Set TMR4 SEVT compare value
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_SEVT_UH:     TMR4 SEVT channel - UH
 *           @arg TMR4_SEVT_UL:     TMR4 SEVT channel - UL
 *           @arg TMR4_SEVT_VH:     TMR4 SEVT channel - VH
 *           @arg TMR4_SEVT_VL:     TMR4 SEVT channel - VL
 *           @arg TMR4_SEVT_WH:     TMR4 SEVT channel - WH
 *           @arg TMR4_SEVT_WL:     TMR4 SEVT channel - WL
 * @param  [in] u16CompareVal       SCCR register value
 *           @arg number of 16bit
 * @retval None
 */
void TMR4_SEVT_SetCompareVal(M4_TMR4_TypeDef *TMR4x,
                            uint32_t u32Ch,
                            uint16_t u16CompareVal)
{
    __IO uint16_t *TMR4_SCCR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_SEVT_CH(u32Ch));

    /* Get actual address of register list of current channel */
    TMR4_SCCR = TMR4_SCCRx(TMR4x, u32Ch);

    /* Set SCCR register */
    WRITE_REG16(*TMR4_SCCR, u16CompareVal);
}

/**
 * @brief  Get TMR4 SEVT compare value
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_SEVT_UH:     TMR4 SEVT channel - UH
 *           @arg TMR4_SEVT_UL:     TMR4 SEVT channel - UL
 *           @arg TMR4_SEVT_VH:     TMR4 SEVT channel - VH
 *           @arg TMR4_SEVT_VL:     TMR4 SEVT channel - VL
 *           @arg TMR4_SEVT_WH:     TMR4 SEVT channel - WH
 *           @arg TMR4_SEVT_WL:     TMR4 SEVT channel - WL
 * @retval SCCR register value
 */
uint16_t TMR4_SEVT_GetCompareVal(const M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch)
{
    __IO uint16_t *TMR4_SCCR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_SEVT_CH(u32Ch));

    /* Get actual address of register list of current channel */
    TMR4_SCCR = TMR4_SCCRx(TMR4x, u32Ch);

    return READ_REG16(*TMR4_SCCR);
}

/**
 * @brief  Set TMR4 SEVT trigger event.
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_SEVT_UH:     TMR4 SEVT channel - UH
 *           @arg TMR4_SEVT_UL:     TMR4 SEVT channel - UL
 *           @arg TMR4_SEVT_VH:     TMR4 SEVT channel - VH
 *           @arg TMR4_SEVT_VL:     TMR4 SEVT channel - VL
 *           @arg TMR4_SEVT_WH:     TMR4 SEVT channel - WH
 *           @arg TMR4_SEVT_WL:     TMR4 SEVT channel - WL
 * @param  [in] u16MaskTimes        Mask times
 *           @arg TMR4_SEVT_MASK_0:   Mask 0 times
 *           @arg TMR4_SEVT_MASK_1:   Mask 1 times
 *           @arg TMR4_SEVT_MASK_2:   Mask 2 times
 *           @arg TMR4_SEVT_MASK_3:   Mask 3 times
 *           @arg TMR4_SEVT_MASK_4:   Mask 4 times
 *           @arg TMR4_SEVT_MASK_5:   Mask 5 times
 *           @arg TMR4_SEVT_MASK_6:   Mask 6 times
 *           @arg TMR4_SEVT_MASK_7:   Mask 7 times
 *           @arg TMR4_SEVT_MASK_8:   Mask 8 times
 *           @arg TMR4_SEVT_MASK_9:   Mask 9 times
 *           @arg TMR4_SEVT_MASK_10:  Mask 10 times
 *           @arg TMR4_SEVT_MASK_11:  Mask 11 times
 *           @arg TMR4_SEVT_MASK_12:  Mask 12 times
 *           @arg TMR4_SEVT_MASK_13:  Mask 13 times
 *           @arg TMR4_SEVT_MASK_14:  Mask 14 times
 *           @arg TMR4_SEVT_MASK_15:  Mask 15 times
 * @retval None
 */
void TMR4_SEVT_SetMaskTimes(M4_TMR4_TypeDef *TMR4x,
                                    uint32_t u32Ch,
                                    uint16_t u16MaskTimes)
{
    __IO uint16_t *TMR4_SCMR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_SEVT_CH(u32Ch));
    DDL_ASSERT(IS_VALID_TMR4_SEVT_MASK(u16MaskTimes));

    /* Get actual address of register list of current channel */
    TMR4_SCMR = TMR4_SCMRx(TMR4x, u32Ch);

    /* Set SCMR register */
    MODIFY_REG16(*TMR4_SCMR, TMR4_SCMR_AMC, u16MaskTimes);
}

/**
 * @brief  Get TMR4 SEVT SCCR register value
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u32Ch               TMR4 SEVT channel
 *         This parameter can be one of the following values:
 *           @arg TMR4_SEVT_UH:     TMR4 SEVT channel - UH
 *           @arg TMR4_SEVT_UL:     TMR4 SEVT channel - UL
 *           @arg TMR4_SEVT_VH:     TMR4 SEVT channel - VH
 *           @arg TMR4_SEVT_VL:     TMR4 SEVT channel - VL
 *           @arg TMR4_SEVT_WH:     TMR4 SEVT channel - WH
 *           @arg TMR4_SEVT_WL:     TMR4 SEVT channel - WL
 * @retval Returned value can be one of the following values:
 *           @arg TMR4_SEVT_MASK_0:   Mask 0 times
 *           @arg TMR4_SEVT_MASK_1:   Mask 1 times
 *           @arg TMR4_SEVT_MASK_2:   Mask 2 times
 *           @arg TMR4_SEVT_MASK_3:   Mask 3 times
 *           @arg TMR4_SEVT_MASK_4:   Mask 4 times
 *           @arg TMR4_SEVT_MASK_5:   Mask 5 times
 *           @arg TMR4_SEVT_MASK_6:   Mask 6 times
 *           @arg TMR4_SEVT_MASK_7:   Mask 7 times
 *           @arg TMR4_SEVT_MASK_8:   Mask 8 times
 *           @arg TMR4_SEVT_MASK_9:   Mask 9 times
 *           @arg TMR4_SEVT_MASK_10:  Mask 10 times
 *           @arg TMR4_SEVT_MASK_11:  Mask 11 times
 *           @arg TMR4_SEVT_MASK_12:  Mask 12 times
 *           @arg TMR4_SEVT_MASK_13:  Mask 13 times
 *           @arg TMR4_SEVT_MASK_14:  Mask 14 times
 *           @arg TMR4_SEVT_MASK_15:  Mask 15 times
 */
uint16_t TMR4_SEVT_GetMaskTimes(const M4_TMR4_TypeDef *TMR4x,
                                        uint32_t u32Ch)
{
    __IO uint16_t *TMR4_SCMR;

    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_SEVT_CH(u32Ch));

    /* Get actual address of register list of current channel */
    TMR4_SCMR = TMR4_SCMRx(TMR4x, u32Ch);

    return READ_REG16_BIT(*TMR4_SCMR, TMR4_SCMR_AMC);
}

/**
 * @brief  Set TMR4 SEVT event signal output to port
 * @param  [in] TMR4x               Pointer to TMR4 instance register base
 *         This parameter can be one of the following values:
 *           @arg M4_TMR4:              TMR4 unit instance register base
 * @param  [in] u16EvtSignal        TMR4 SEVT event signal selection
 *         This parameter can be one of the following values:
 *           @arg TMR4_SEVT_PORT_OUTPUT_NONE: Disable output event signal of TMR4 Special-EVT
 *           @arg TMR4_SEVT_PORT_OUTPUT_EVENT0_SIGNAL: Output the specified event 0 signal of TMR4 Special-EVT
 *           @arg TMR4_SEVT_PORT_OUTPUT_EVENT1_SIGNAL: Output the specified event 1 signal of TMR4 Special-EVT
 *           @arg TMR4_SEVT_PORT_OUTPUT_EVENT2_SIGNAL: Output the specified event 2 signal of TMR4 Special-EVT
 *           @arg TMR4_SEVT_PORT_OUTPUT_EVENT3_SIGNAL: Output the specified event 3 signal of TMR4 Special-EVT
 *           @arg TMR4_SEVT_PORT_OUTPUT_EVENT4_SIGNAL: Output the specified event 4 signal of TMR4 Special-EVT
 *           @arg TMR4_SEVT_PORT_OUTPUT_EVENT5_SIGNAL: Output the specified event 5 signal of TMR4 Special-EVT
 * @retval None
 */
void TMR4_SEVT_SetPortOutputEventSig(M4_TMR4_TypeDef *TMR4x,
                                            uint16_t u16EvtSignal)
{
    /* Check parameters */
    DDL_ASSERT(IS_VALID_TMR4_INSTANCE(TMR4x));
    DDL_ASSERT(IS_VALID_TMR4_SEVT_PORT_OUTPUT_SIGNAL(u16EvtSignal));

